AccumulationRegisters/ОбеспечениеЗаказовРаботами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОбеспечениеЗаказовРаботами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Назначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Назначения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказМатериаловВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПереработчику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДавальца</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвиженияПоСкладскимРегистрам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьТолькоНаличие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ОбеспечениеЗаказовРаботами/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка ИЛИ НЕ ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		
		Возврат;

	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	БлокироватьДляИзменения = Истина;

	// Текущее состояние набора помещается во временную таблицу, чтобы при записи получить
	// изменение нового набора относительно текущего.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Таблица.Назначение     КАК Назначение,
	|	Таблица.Номенклатура   КАК Номенклатура,
	|	Таблица.Характеристика КАК Характеристика,
	|	Таблица.Подразделение  КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Таблица.КОбеспечению
	|		ИНАЧЕ -Таблица.КОбеспечению
	|	КОНЕЦ                  КАК КОбеспечениюПередЗаписью
	|ПОМЕСТИТЬ ОбеспечениеЗаказовРаботамиПередЗаписью
	|ИЗ
	|	РегистрНакопления.ОбеспечениеЗаказовРаботами КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НазначенияБезКонтроля
	|		ПО Таблица.Назначение = НазначенияБезКонтроля.Ссылка
	|		 И(НазначенияБезКонтроля.Заказ = НЕОПРЕДЕЛЕНО
	|			ИЛИ НазначенияБезКонтроля.КонтролироватьТолькоНаличие
	//++ НЕ УТКА
	|			ИЛИ НазначенияБезКонтроля.Заказ ССЫЛКА Документ.ЗаказДавальца
	//-- НЕ УТКА
	|)
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НазначенияБезКонтроля.Ссылка ЕСТЬ NULL
	|	И НЕ &ЭтоНовый");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка ИЛИ НЕ ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		
		Возврат;
		
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Назначение                   КАК Назначение,
	|	ТаблицаИзменений.Номенклатура                 КАК Номенклатура,
	|	ТаблицаИзменений.Характеристика               КАК Характеристика,
	|	ТаблицаИзменений.Подразделение                КАК Подразделение,
	|	СУММА(ТаблицаИзменений.КОбеспечениюИзменение) КАК КОбеспечениюИзменение
	|ПОМЕСТИТЬ ОбеспечениеЗаказовРаботамиИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Назначение               КАК Назначение,
	|		Таблица.Номенклатура             КАК Номенклатура,
	|		Таблица.Характеристика           КАК Характеристика,
	|		Таблица.Подразделение            КАК Подразделение,
	|		Таблица.КОбеспечениюПередЗаписью КАК КОбеспечениюИзменение
	|	ИЗ
	|		ОбеспечениеЗаказовРаботамиПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Назначение              КАК Назначение,
	|		Таблица.Номенклатура            КАК Номенклатура,
	|		Таблица.Характеристика          КАК Характеристика,
	|		Таблица.Подразделение           КАК Подразделение,
	|		ВЫБОР
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -Таблица.КОбеспечению
	|			ИНАЧЕ Таблица.КОбеспечению
	|		КОНЕЦ                           КАК КОбеспечениюИзменение
	|	ИЗ
	|		РегистрНакопления.ОбеспечениеЗаказовРаботами КАК Таблица
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НазначенияБезКонтроля
	|		ПО Таблица.Назначение = НазначенияБезКонтроля.Ссылка
	|		 И(НазначенияБезКонтроля.Заказ = НЕОПРЕДЕЛЕНО
	|			ИЛИ НазначенияБезКонтроля.КонтролироватьТолькоНаличие
	//++ НЕ УТКА
	|			ИЛИ НазначенияБезКонтроля.Заказ ССЫЛКА Документ.ЗаказДавальца
	//-- НЕ УТКА
	|	)
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор
	|		И НазначенияБезКонтроля.Ссылка ЕСТЬ NULL) КАК ТаблицаИзменений
	|
	|ГДЕ
	|	&КонтролироватьПревышение
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Назначение,
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.Характеристика,
	|	ТаблицаИзменений.Подразделение
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаИзменений.КОбеспечениюИзменение) > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбеспечениеЗаказовРаботамиПередЗаписью");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонтролироватьПревышение",
		Не ПолучитьФункциональнуюОпцию("РазрешитьОбособлениеТоваровСверхПотребности"));
	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();
	
	// Новые изменения были помещены во временную таблицу.
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ОбеспечениеЗаказовРаботамиИзменение", Выборка.Количество > 0);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
